Tekla.Structures.Model.RebarSetAddition
The RebarSetAddition class can be used to add Tekla.Structures.Model.RebarLegFace objects to an existing Tekla.Structures.Model.RebarSet.
The following example shows how to create and add a RebarSetAddition, to a rebarset.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
// Create and insert a rebarset (see the RebarSet example).
var rebarSet = new RebarSet();
// Create the RebarSetAddition
var rebarSetAddition = new RebarSetAddition();
// Create an additional leg face
var additionalLegFace = new RebarLegFace
{
LayerOrderNumber = 2,
AdditonalOffset = 25.0,
Reversed = false
};
additionalLegFace.Contour.AddContourPoint(new ContourPoint(new Point(800, 0, 0), null));
additionalLegFace.Contour.AddContourPoint(new ContourPoint(new Point(800, 0, 500), null));
additionalLegFace.Contour.AddContourPoint(new ContourPoint(new Point(800, 1200,500), null));
additionalLegFace.Contour.AddContourPoint(new ContourPoint(new Point(800, 1200, 0), null));
// Insert the additional leg face
rebarSetAddition.LegFaces.Add(additionalLegFace);
rebarSetAddition.Father = rebarSet;
rebarSetAddition.Insert();
}
}

Tekla.Structures.Model.RebarSetAddition.#ctor
Initializes a new instance of the Tekla.Structures.Model.RebarSetAddition class with empty attributes.

Tekla.Structures.Model.RebarSetAddition.LegFaces
Gets or sets the rebar set addition's Tekla.Structures.Model.RebarLegFace objects.

Tekla.Structures.Model.RebarSetAddition.Father
Gets or sets the Tekla.Structures.Model.RebarSet to which the rebar set addition applies.

Tekla.Structures.Model.RebarSetAddition.Insert
Inserts the rebar set addition into the model database.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.RebarSetAddition.Modify
Modifies the rebar set addition in the model database to match the current one.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.RebarSetAddition.Delete
Deletes the rebar set addition with the given identifier from the model database.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.RebarSetAddition.Select
Selects the rebar set addition from the model database. The rebar set addition identifier must be set.
Returns: True if successful, otherwise false.